SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( "#BR Class 6100 No 6136"
 Type ( Engine )
 WagonShape ( 6136.s )
 FreightAnim ( crew_09.s 1 1 )
 Size ( 2.95051m 3.85924m 12.4117m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 7.0548e-006m 1.97988m -0.0755904m )
 Mass ( 78.0t )
 InertiaTensor ( Box(2.95051m 3.85924m 12.4117m) )
 Coupling (
 Type ( Automatic )
 Spring (
 Stiffness ( 2e6N/m 0 )
 Damping ( 0.5e5N/m/s 0)
 Break ( 2e7N 0 )
 r0 ( 10cm 1e9 )
 )
 Velocity ( 0.1m/s )
 )
 Buffers (
 Spring (
 Stiffness ( 1e6N/m 1e9N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 r0 ( 5cm 10cm )
 )
 Centre ( 0.5 )
 Radius ( 1 )
 Angle ( 0.5deg )
 )
 Antislip ( 1 )
Adheasion ( 0.15 0.3 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 200kN )
 DerailBufferForce ( 800kN )
 WheelRadius ( 0.4825m )
 NumWheels ( 4 )
 Friction (
 895N/m/s -0.10 1mph 8.566N/m/s 1.864
 5.1N/rad/s 1 -1rad/s 0 1
 ) 
 IntakePoint ( -5.42 3.27 FuelCoal )
 IntakePoint ( 1.49 3.16 FuelWater )

 BrakeEquipmentType ( "Vacuum_brake, Handbrake" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 101989N )
 MaxHandbrakeForce( 78453N )
 NumberOfHandbrakeLeverSteps( 100 )
 MaxReleaseRate( 10 )
 MaxApplicationRate( 10 )
 
 BrakeCylinderPressureForMaxBrakeBrakeForce( 25 ) 
 Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-100b-eng01.sms" )

 Lights ( 18
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffff70 )
 Position ( -1.07503 1.45024 5.56047 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.4 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ff0000 )
 Position ( -0.0896112 2.87884 -6.0582 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.5 )
 )
 )
 )
 Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffe610 )
 Position ( 0 10.0 -12.0 )
 Transition ( 0 )
 Radius ( 6.0 )
 Angle ( 90.0 )
 )
 )
 )
 Light (
 
 Type ( 1 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffe610 )
 Position ( 0 10.0 -13.50 )
 Transition ( 0 )
 Radius ( 6.0 )
 Angle ( 90.0 )
 )
 )
 )



 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 Cycle ( 0 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffff70 )
 Position ( 1.07503 1.45024 5.56047 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 0.4 )
 )
 )
 )
 Light ( 
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0 )
 FadeOut ( 0 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ff7200 )
 Position ( -0.2 3.4 -2.62 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.15 )
 )
 )
 )
 Light ( 
 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0 )
 FadeOut ( 0 )
 Cycle ( 0 )
 States ( 1
 State (
 Duration ( 0.0 )
 LightColour ( 80ffe610 )
 Position ( -0.2 3.4 -2.62 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 0.15 )
 )
 )
 )
 Light (
 
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.5 )
 LightColour ( eeff8800 )
 Position ( 0 2.2 -2.62 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.3 )
 LightColour ( eeff8800 )
 Position ( 0 2.2 -2.62 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 
 )
 
 )
 )
 Light ( 
 comment( Ashpan flashes ) 
 Type ( 0 ) 
 Conditions ( 
 Headlight ( 3 ) 
 Unit ( 0 ) 
 ) 
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 1 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 01.4 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.4 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -4.0 )
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 3 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 5 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -4.0 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.30 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( -0.1 0.14 -2.12 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 1 ) 
 )
 )
 )
 Light ( 
 comment( Chimney Sparks RS1AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.42 3.37 )

 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.72 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.52 3.37 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.72 3.37 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.92 3.37 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.32 3.37 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.52 3.37 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.92 3.37 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.226 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.35 3.37 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.55 3.37 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.25 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.37 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 4.22 3.37 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.37 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.225 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 3.37 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.233 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 9.22 3.37 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 )
 )
 )

 Light ( 
 comment( Chimney Sparks RS1AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )

 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.234 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.234 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.2235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 8.22 2.7 )
 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 9.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0 5.22 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 6.22 2.72 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.72 )
 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0 6.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 5.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0 7.22 2.72 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 )
 )
 )

 Light ( 
 comment( Chimney Sparks AA1 ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.0 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.0 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 8.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 8.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 )
 Position ( 0.0 6.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 8.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.0 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 )
 )
 )

 Light ( 
 comment( Chimney Sparks AA ) 
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 TimeOfDay ( 0 )
 Weather ( 0 )
 Coupling ( 0 ) 
 )
 Cycle ( 0 ) 
 FadeIn ( 0 ) 
 FadeOut ( 0.5 ) 
 States ( 28 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.236 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.1 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.3 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 90 90 90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 3 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 ) 
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 ) 
 Azimuth ( -180 -180 -180 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 6.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 )
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.25 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 7.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.5 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 7.5 2.7 )
 Azimuth ( -90 -90 -90 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.4 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 00000000 ) 
 Position ( 0.0 5.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.235 ) 
 ) 
 State ( 
 Duration ( 0.2 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 4.5 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.23 ) 
 ) 
 State ( 
 Duration ( 0.6 ) 
 LightColour ( 80ff7200 ) 
 Position ( 0.0 4.50 2.7 )
 Azimuth ( 0 0 0 ) 
 Transition ( 0 ) 
 Radius ( 0.230 ) 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 0.975 )
 FadeOut ( 0.975 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.645 -1.502 )
 Azimuth ( -90 -90 -90 )
 Transition ( 0 )
 Radius ( 1.3 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.62 -1.502 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1.3 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 2 )
 )
 FadeIn ( 0.75 )
 FadeOut ( 0.75 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.502 )
 Azimuth ( 45 45 45 )
 Transition ( 0 )
 Radius ( 1.35 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.502 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.35 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front )
 Type ( 0 )
 Conditions (
 Headlight ( 3 )
 Unit ( 2 )
 )
 FadeIn ( 1.95 )
 FadeOut ( 1.95 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.502 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.34 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.655 -1.502 )
 Azimuth ( 180 180 180 )
 Transition ( 0 )
 Radius ( 1.34 )
 
 )
 )
 )

 Light (
 comment( Flickering Ashpan Front Leading )
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 2 )
 )
 FadeIn ( 1.5 )
 FadeOut ( 1.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0.0 0.652 -1.502 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 1.34 )
 Elevation ( -10 -10 -10 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0.0 0.652 -1.502 )
 Azimuth ( 0.0 -5.0 5.0 )
 Transition ( 0 )
 Radius ( 1.34 )
 Elevation ( -10 -10 -10 )
 )
 )
 )

 Light (
 comment( Flickering Ashpan Back )
 Type ( 0 )
 Conditions (
 Headlight ( 0 )
 Unit ( 0 )
 )
 FadeIn ( 0.5 )
 FadeOut ( 0.5 )
 Cycle ( 0 )
 States ( 2
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.643 -4.5 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1 )
 )
 State (
 Duration ( 0.05 )
 LightColour ( 80ff7200 )
 Position ( -0 0.643 -4.5 )
 Azimuth ( -180 -180 -180 )
 Transition ( 0 )
 Radius ( 1 )
 
 )
 )
 )

 )

 )

Engine ( "#BR Class 6100 No 6136" 
 Effects (
 SteamSpecialEffects
 (
 StackFX
 (
 0 3.93192 3.71856
 0 2 0
 .3
 )
 SafetyValvesFX
 (
 0 3.81 0.24384
 0 2 0
 .1
 )
 WhistleFX
 (
 0 3.84048 -2.19456
 0 1 0
 .1
 )
 CylindersFX
 (
 -1.03632 0.42672 4.29768
 0 0 1
 .1
 )
 CylindersFX
 (
 1.03632 0.42672 4.29768
 0 0 1
 .1
 )
 )
 )

 Wagon ( "#BR Class 6100 No 6136" )
 IsTenderRequired( -1 ) 
 Type ( Steam )
 MaxPower ( 1106.59kW )
 MaxForce ( 24300lbf )
 MaxVelocity ( 70mph )
 WheelRadius ( 34in )
 Sanding ( 1e9mph )
 NumWheels ( 3 )
 BoilerLength ( 3.35m )
 BoilerVolume ( "191*(ft^3)" )
 BoilerEffectivity ( 1.1 )
 DraftingEffect ( 0.8 )
 BoilerResponsiveness ( 1.1 )
 CoalBurnage ( 3.6lb/hp/h )
 MaxBoilerOutput ( 20500lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 30in )
 CylinderDiameter ( 18in )
 CylinderVolume ( "8.834*(ft^3)" )
 CylinderEffectivity ( 1 )
 InjectorSizes ( 9mm 10mm )
 ExhaustLimit ( 16000lb/h )
 PrimingFactor ( 1 )
 BlastExponent ( 0.9 )
 MaxBoilerPressure ( 225psi )
 MaxFireMass ( 2000lb )
 IdealFireMass ( 1400lb )
 MaxWaterMass ( 3000lb ) 
 SafetyValvesSteamUsage ( 5000lb/h )
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 8000lb )
 MaxTenderWaterMass ( 20000lb )

 comment(0 for live steam, 1 for exhaust steam)
 InjectorTypes( 0 1 ) 
 SuperHeater ( 1.25 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 SteamMaxSmokeUnitsReleaseRate( 10 )
 MaxSteamHeatingPressure( 80 )
 SafetyValvePressureDifference( 5 )
 SteamGaugeGlassHeight( 10 )
 BasicSteamUsage ( 200lb/h )
 BasicCoalUsage ( 50lb/h )

 comment( min steam pressure, min water proportion, max water proportion )
 InjectorLimits1 ( 50psi 0.6 1 )
 InjectorLimits2 ( 60psi 0 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 VacuumBrakesSmallEjectorPowerRating( 3.5 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 250 )
 VacuumBrakesLargeEjectorUsageRate( 1000 )
 VacuumBrakesHasVacuumPump( 0 )

 TrainBrakesControllerMaxReleaseRate( 12 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
 EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType ( "Vacuum_single_pipe" )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )

 SteamSmallestCutoff( 8 )
 NumberOfDamperSteps( 4 )

 RegulatorValveType ( Twin_port )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorPilotValveExponent( 1.7 )
 RegulatorSecondValveExponent( 1.7 )
 RegulatorPilotValveFullOpenning( 0.3 )
 RegulatorMainValveInitialOpenning( 0.4 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 
 
 
 
 
 
 SteamSmokeUnitsPerPoundOfFuel( 6.3 )

  
 

 EngineControllers (
 comment( Engine controls )
 
 Regulator ( 0 1 0.025 0 
 NumNotches( 0 )
 )

 Cutoff ( -0.75 0.75 0.0075 0 
 NumNotches( 15
 Notch ( -0.75 0 Dummy )
 Notch ( -0.65 0 Dummy )
 Notch ( -0.55 0 Dummy )
 Notch ( -0.45 0 Dummy )
 Notch ( -0.35 0 Dummy )
 Notch ( -0.25 0 Dummy )
 Notch ( -0.15 0 Dummy )
 Notch ( 0.0 0 Dummy )
 Notch ( 0.15 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.35 0 Dummy )
 Notch ( 0.45 0 Dummy )
 Notch ( 0.55 0 Dummy )
 Notch ( 0.65 0 Dummy )
 Notch ( 0.75 0 Dummy )
 
 )
 )
 
 Brake_Train ( 0 1 0.0375 0.65
 NumNotches( 3
 Notch( 0 1 TrainBrakesControllerReleaseStart )
 Notch(0.01 1 TrainBrakesControllerRunningStart )
 Notch(0.2 1 TrainBrakesControllerApplyStart )
 )
 )
 Brake_Hand ( 0 1 0.0125 0 
 NumNotches( 0 )
 )
 FireDoor ( 0 1 0.075 1 
 NumNotches( 0 )
 )
 Sanding( 0 1 0 )
 Blower ( 0 1 0.025 0.02 
 NumNotches( 0 )
 )
 HeatingTap ( 0 1 0.035 0 
 NumNotches( 5 
 Notch ( 0 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )
 Shovel ( 0 1 1 0 
 NumNotches( 5
 Notch ( 0 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 Notch ( 2 0 Dummy )
 
 )
 )
 
 DampersFront ( 0 1 0.1 0.15 
 NumNotches ( 6 
 Notch ( 0 0 Dummy )
 Notch ( 0.15 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )


 
 )
 )
 Injector1Steam ( 0 1 0 )
 Injector2Steam ( 0 1 0 )
 Injector1Water ( 0 1 0.1 0 
 NumNotches( 5 
 Notch ( 0 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )

 )
 )
 
 Injector2Water ( 0 1 0.1 0 
 NumNotches( 5 
 Notch ( 0 0 Dummy )
 Notch ( 0.25 0 Dummy )
 Notch ( 0.5 0 Dummy )
 Notch ( 0.75 0 Dummy )
 Notch ( 1 0 Dummy )
 
 )
 )

 CylinderCocks ( 0 1 1 )
 Whistle ( 0 1 0 )
 WaterScoop ( 0 1 0 )
 SmallEjectorOrCompressor( 0 1 0 )
 Headlights( 0 1 0 )
 )

 comment(fire temp, fire mass, water mass, boiler pressure,
 water level, tender_water_mass, tender_coal_mass,
 smoke_quantity, fire_condition, coal quality )
 
 EngineVariables( 950 1350 2000 220 0.5 13000 7750 350 0.95 0.9 )
 
 Name ( "#BR Class 6100 No 6136" )
 Description (
 "Western Region Class 6100 Tank Engine.\n\n"+ 
 "This was the same as the 5100 tank but with an increased boiler pressure of 225lb.\n\n"+
 "They were built for hauling suburban trains in the London area where most of them were allocated. They were also to be found running the line from Paddington to High Wycombe and Aylesbury.\n\n"+
 "They started to disappear as the first DMU's were introduced.\n\n"+
 "Original model of BR Green 5199 by Reg Furniss."

 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+ 
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)
